nrfconnect/sdk-nrf-bm/components/softdevice/nrf54lv/s145/s145_API/include/ble_gap.h
/**@brief Get the received signal strength for the last connection event.
 *
 *        @ref sd_ble_gap_rssi_start must be called to start reporting RSSI before using this function. @ref NRF_ERROR_NOT_FOUND
 *        will be returned until RSSI was sampled for the first time after calling @ref sd_ble_gap_rssi_start.
 * @note ERRATA-153 and ERRATA-225 require the rssi sample to be compensated based on a temperature measurement.
 * @mscs
 * @mmsc{@ref BLE_GAP_CENTRAL_RSSI_READ_MSC}
 * @endmscs
 *
 * @param[in]  conn_handle Connection handle.
 * @param[out] p_rssi      Pointer to the location where the RSSI measurement shall be stored.
 * @param[out] p_ch_index  Pointer to the location where Channel Index for the RSSI measurement shall be stored.
 *
 * @retval ::NRF_SUCCESS                   Successfully read the RSSI.
 * @retval ::NRF_ERROR_NOT_FOUND           No sample is available.
 * @retval ::NRF_ERROR_INVALID_ADDR        Invalid pointer supplied.
 * @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied.
 * @retval ::NRF_ERROR_INVALID_STATE       RSSI reporting is not ongoing.
 */
SVCALL(SD_BLE_GAP_RSSI_GET, uint32_t, sd_ble_gap_rssi_get(uint16_t conn_handle, int8_t *p_rssi, uint8_t *p_ch_index));


/**@brief   Enable or disable Quality of Service (QoS) connection event reporting.
 *
 * @details When enabled, @ref BLE_GAP_EVT_QOS_CONN_EVENT_REPORT events will be reported for each connection event.
 *
 * @note    The SoftDevice may generate one @ref BLE_GAP_EVT_QOS_CONN_EVENT_REPORT event after disabling.
 *
 * @param[in] enable Set to @ref BLE_GAP_QOS_CONN_EVENT_REPORT_ENABLE to enable reporting.
 *                   Set to @ref BLE_GAP_QOS_CONN_EVENT_REPORT_DISABLE to disable reporting.
 *
 * @retval ::NRF_SUCCESS The QoS connection event reporting is successfully enabled or disabled.
 */
SVCALL(SD_BLE_GAP_QOS_CONN_EVENT_REPORT_ENABLE, uint32_t, sd_ble_gap_qos_conn_event_report_enable(uint8_t enable));


/** @} */

#ifdef __cplusplus
}
#endif
#endif // BLE_GAP_H__

/**
  @}
*/
